const getColumns=(data)=>{
    let arr = []
    list.forEach((item)=>{
        if(item.title==data){
            arr =  item.columns
        }
    })
    return arr
}

const list=[
    { title: "日行驶里程报表" ,columns:[
        '车厂','车型','车辆VIN','日期','当然里程(km)'
    ]},
    { title: "车辆全参数" ,columns:[
        'VIN','时间','经度','纬度','车辆状态','充电状态','运行模式',
        '车速(km/h)','累计里程','总电压','总电流','SOC','DC-D'
    ]},
    { title: "月形式里程报表",columns:[
        '车厂','车型','车辆VIN','01月里程','02月里程','03月里程','04月里程','05月里程',
        '06月里程','07月里程','08月里程','09月里程','10月里程','11月里程','12月里程',
        '合计'
    ] },
    { title: "入网统计报表",columns:[
        '车厂','入网日期','新增入网车辆数','注册车辆数','总入网车辆数'
    ] },
    { title: "车辆最后上数报表",columns:[
        '车厂','车型','车辆VIN','最后一次上传数据时间','经度','纬度','地点'
    ] },
    { title: "停车报表" ,columns:[
        '车厂','车型','VIN','停车地点','停车时长','开始时间','结束时间'
    ]},
    { title: "行驶车辆报表" ,columns:[
        '车厂','车型','时间','行驶车辆','停驶车辆','在线车辆'
    ]},
    { title: "车辆行程报表",columns:[
        '车厂','VIN','起始时间','终止时间','行驶时长','行驶里程(km)','起始地点','终止地点'
    ] },
    { title: "超3天未行驶报表" ,columns:[
        '车厂','车型','VIN','开始时间','结束时间','未行驶时长','停车地点'

    ]},
    {  title: "离线超3天报表" ,columns:[
        '车厂','车型','VIN','开始时间','结束时间','离线时长','最后定位位置'
    ]},
    {  title: "月活跃车辆报表",columns:[
        '车厂','时间','活跃车辆','未活跃车辆','入网车辆','注册车辆'

    ] },
    {  title: "车辆总里程报表",columns:[
        '车厂','车型','VIN','车牌号','总里程'
    ] },

    //基础数据报表
    {  title: "车厂信息报表",columns:[
        '车厂名称','车型数量','车辆数量','车厂简称','平台用户名','负责人','手机号','平台IP','注册时间'
    ] },
    {  title: "车型信息报表",columns:[
        '车型','车型名称','车厂','车辆类型','车辆种类','车辆级别','品牌','车系','年款','燃料种类','充电方式'
    ] },
    {  title: "车辆信息报表",columns:[
        'VIN','车牌号','车型','车厂名称','客户名称','公告批次','注册时间','入网时间'
    ] },
    {  title: "客户信息报备",columns:[
        '客户名称','客户类型','联系电话','添加时间'
    ] },
    
    //车辆报警报表
    {  title: "报警数据报表",columns:[
      '车厂','车型','VIN','报警时间','报警名称','报警来源','报警地点','关闭时间',
      '关闭方式','处理人'
    ] },

    //平台相关报表
    {  title: "平台掉线统计报表",columns:[
        '车厂','客户端IP','客户端端口','连线时间','离线时间','在线时长'
    ] },
    //第三方报表
    {  title: "保险公司数据",columns:[
        '保险公司名称','地址','李欣然','手机号','邮箱'
    ] },
    {  title: "电池厂家数据",columns:[
        '电池厂家名称','生产厂商代码','地址','联系人','手机号','邮箱'
    ] },
    {  title: "充电运营公司数据报表",columns:[
        '充电运营公司名称','企业编号','企业平台IP地址','联系人','手机号','邮箱'
    ] },
    {  title: "经销商数据报表",columns:[
        '经销商名称','地址','联系人','手机号','邮箱'
    ] },
]
export default getColumns